public_html/docs/Programming/Documents.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Programming documents</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Programming documents"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-30 10:46:49 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Programming documents</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">http://herbert.the-little-red-haired-girl.org/en/compdocs/index.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><a href="http://herbert.the-little-red-haired-girl.org/en/compdocs/index.html">http://herbert.the-little-red-haired-girl.org/en/compdocs/index.html</a></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>GNU Bison Reference Manual. (DVI) (Postscript).
</li>
<li>Can't Happen or <i>* NOTREACHED *</i> or Real Programs Dump Core is a classic article on avoiding bugs when programming (in C) (PDF File)!
</li>
<li>The CVS Documentation (HTML) (HTML tree in a tar archive).
</li>
<li>Using and Porting GNU CC (DVI) (Postscript), the GNU C Preprozessor (DVI) (Postscript), both (HTML trees in a tar archive).
</li>
<li>GNU C Reference Card (DVI) (Postscript).
</li>
<li>GDB Reference Card (DVI) (Postscript).
</li>
<li>Debugging with the GNU Debugger (DVI) (Postscript) (HTML tree in a tar archive).
</li>
<li>The GNU C Library Reference Manual (DVI) (Postscript) (HTML tree in a tar archive).
</li>
<li>User's Guide to the GNU C++ Library (DVI) (Postscript).
</li>
<li>lclint, a C Source Code Checker (HTML) (HTML tree in a tar archive). The (longish) one file version is useful for searching the documentation.
</li>
<li>GNU make (DVI) (Postscript) (HTML tree in a tar archive).
</li>
<li>The GNU Coding Standards (DVI) (Postscript) (HTML tree in a tar archive).

</li>
<li>The JavaTM 2 Platform, Standard Edition, v1.2.2 API Specification (the
</li>
</ul>

<p>main page contains further links).
</p>

<ul>
<li>The GNU tar Documentation (HTML) (HTML tree as tar archive).
</li>
<li>The Texinfo Documentation (DVI) (Postscript) (HTML tree as tar
</li>
</ul>

<p>archive).
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-30 10:46:49 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
